Revit 2026 API

# HardwoodImperfectionsType Enumeration

---

The enumerated type representing the permitted values for the asset property "HardwoodImperfections" from the "Hardwood" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum HardwoodImperfectionsType
```
```vb
Public Enumeration HardwoodImperfectionsType
```
```cpp
public enum class HardwoodImperfectionsType
```
```fsharp
type HardwoodImperfectionsType
```

| Member name | Value | Description |
| --- | --- | --- |
| Automatic | 1 |  |
| Custom | 2 |  |
| None | 0 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace